# Задайте последовательность чисел. Напишите программу,
# которая выведет список неповторяющихся элементов исходной последовательности.

task_list = [111, 11, 11, 23, 34, 111, 66, 54, 67, 54]
print(task_list)
print(list(set(task_list)))
